In [25]:
#importinr libraries
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
from sklearn.linear_model import LinearRegression
from sklearn.model_selection import train_test_split
from sklearn.metrics import accuracy_score, r2_score, mean_squared_error

In [26]:
#Importing dataset
data = pd.read_csv('uber.csv')

In [27]:
#Check data
data.head()

,Unnamed: 0,key,fare_amount,pickup_datetime,pickup_longitude,pickup_latitude,dropoff_longitude,dropoff_latitude,passenger_count
0,24238194,2015-05-07 19:52:06.0000003,7.5,2015-05-07 19:52:06 UTC,-73.999817,40.738354,-73.999512,40.723217,1
1,27835199,2009-07-17 20:04:56.0000002,7.7,2009-07-17 20:04:56 UTC,-73.994355,40.728225,-73.994710,40.750325,1
2,44984355,2009-08-24 21:45:00.00000061,12.9,2009-08-24 21:45:00 UTC,-74.005043,40.740770,-73.962565,40.772647,1
3,25894730,2009-06-26 08:22:21.0000001,5.3,2009-06-26 08:22:21 UTC,-73.976124,40.790844,-73.965316,40.803349,3
4,17610152,2014-08-28 17:47:00.000000188,16.0,2014-08-28 17:47:00 UTC,-73.925023,40.744085,-73.973082,40.761247,5

In [28]:
#Remove unnecessary data
data.drop(['Unnamed: 0'], inplace=True, axis=1)

In [29]:
data.head()

,key,fare_amount,pickup_datetime,pickup_longitude,pickup_latitude,dropoff_longitude,dropoff_latitude,passenger_count
0,2015-05-07 19:52:06.0000003,7.5,2015-05-07 19:52:06 UTC,-73.999817,40.738354,-73.999512,40.723217,1
1,2009-07-17 20:04:56.0000002,7.7,2009-07-17 20:04:56 UTC,-73.994355,40.728225,-73.994710,40.750325,1
2,2009-08-24 21:45:00.00000061,12.9,2009-08-24 21:45:00 UTC,-74.005043,40.740770,-73.962565,40.772647,1
3,2009-06-26 08:22:21.0000001,5.3,2009-06-26 08:22:21 UTC,-73.976124,40.790844,-73.965316,40.803349,3
4,2014-08-28 17:47:00.000000188,16.0,2014-08-28 17:47:00 UTC,-73.925023,40.744085,-73.973082,40.761247,5

In [30]:
#Checking for null values
data.isnull().sum()

key                  0
fare_amount          0
pickup_datetime      0
pickup_longitude     0
pickup_latitude      0
dropoff_longitude    1
dropoff_latitude     1
passenger_count      0
dtype: int64

In [31]:
#Handling null values
data = data.dropna()

In [32]:
#Formating datetime column
data['pickup_datetime']= pd.to_datetime(data['pickup_datetime'], format='%Y-%m-%d %H:%M:%S UTC')

In [33]:
data.head()

,key,fare_amount,pickup_datetime,pickup_longitude,pickup_latitude,dropoff_longitude,dropoff_latitude,passenger_count
0,2015-05-07 19:52:06.0000003,7.5,2015-05-07 19:52:06,-73.999817,40.738354,-73.999512,40.723217,1
1,2009-07-17 20:04:56.0000002,7.7,2009-07-17 20:04:56,-73.994355,40.728225,-73.994710,40.750325,1
2,2009-08-24 21:45:00.00000061,12.9,2009-08-24 21:45:00,-74.005043,40.740770,-73.962565,40.772647,1
3,2009-06-26 08:22:21.0000001,5.3,2009-06-26 08:22:21,-73.976124,40.790844,-73.965316,40.803349,3
4,2014-08-28 17:47:00.000000188,16.0,2014-08-28 17:47:00,-73.925023,40.744085,-73.973082,40.761247,5

In [34]:
#Handling duplicates values
data = data.drop_duplicates()

In [35]:
# Split the data into training and testing sets
X = data[['pickup_latitude','pickup_latitude','pickup_latitude','pickup_latitude','pickup_latitude']]
y = data['fare_amount']

In [36]:
#training dataset
X_train,X_test, y_train, y_test = train_test_split(X,y, test_size=0.2, random_state=42)

In [37]:
#Building Linear Regression Model 
lr = LinearRegression()
lr.fit(X_train,y_train)

LinearRegression()

In [38]:
#Fare prediction
y_pred = lr.predict(X_test)

In [39]:
y_pred

array([11.34542828, 11.34516764, 11.34564663, ..., 11.34524435,
       11.34539096, 11.34542484])

In [41]:
#Checking accuracy of the model
mse = mean_squared_error(y_test,y_pred)
rmse = round(mse**0.5,2)
print(f'RMSE:{rmse}')

RMSE:10.2

In [43]:
r2_lr = r2_score(y_test, y_pred)
print('R2 score of Linear Regression is:', r2_lr)

R2 score of Linear Regression is: 0.00011666033341373172